edward1477/stm32f407xx/Src/002led_button.c
/*
 * 002led_button.c
 *
 *  Created on: May 18, 2021
 *      Author: Edward
 */

#include "stm32f407xx.h"
#include "stm32f407xx_gpio_driver.h" /*This code also could be happened at the end of stm32f407xx.h file */

#define HIGH 		ENABLE
#define BTN_PRESSED HIGH

void delay(void){
	for(uint32_t i = 0 ; i < 200000 ; i++);
}

int main(void){

	//1. Create a structure variable to handle the target peripheral (e.g. GPIO in this case)
	GPIO_Handle_t	Gpioled, GpioBtn;

	//2. Initialization of GPIO which handle the LED
	Gpioled.pGPIOx = GPIOD;
	Gpioled.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	Gpioled.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	Gpioled.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	Gpioled.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	Gpioled.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOD, ENABLE);

	GPIO_Init(&Gpioled);

	//3. Initialization of GPIO which handle the Button
	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOA, ENABLE);

	GPIO_Init(&GpioBtn);

	//4. After all initialization steps, we could write code to implement toggle LED
	while(1){
		if(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0) == BTN_PRESSED){
			delay();										//tackling btn bouncing issue
			GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_12);
		}
	}
	return 0;
}
